Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: If it outputs a version number, but it’s less than 1.3.0, run the following command to update it:
ja: 出力されたバージョンナンバーが 1.3.0 以下なら、次のコマンドを実行してアップデートしてください。

source: If it was successful, Craft will redirect your browser to the Control Panel dashboard.
ja: インストールが成功したら、Craft はブラウザをコントロールパネルのダッシュボードにリダイレクトします。

source: If it was successful, Craft will redirect your browser to the Control Panel.
ja: インストールが成功したら、Craft はブラウザをコントロールパネルにリダイレクトします。

source: If it’s a web request, Craft will capture it and log it to storage/logs/ just as if you had used Craft::info().
ja: ウェブリクエストであれば、Craft::info() を使用したときと同様に、Craft がそれを取得して storage/logs/ に記録します。

source: If multiple blocks are selected, all of the selected blocks will be going along for the ride.
ja: 複数のブロックが選択されている場合、選択されたすべてのブロックが一緒に移動します。

source: If multiple blocks are selected, the Collapse/Expand, Disable/Enable, and Delete options will apply to all of the selected blocks.
ja: 複数のブロックが選択されている場合、選択されたすべてのブロックに対して「折りたたむ / 展開する」「無効 / 有効」および「削除」オプションが適用されます。

source: If no category is specified, it will default to site.
ja: カテゴリの指定がない場合、デフォルトで site になります。

source: If no level is specified then the nesting level is unlimited.
ja: レベルを指定していない場合、無制限にネストできます。

source: If none of the above checks are successful, Craft will return a 404.
ja: 上記のチェックがいずれも成功しなかった場合、Craf は 404 を返します。

source: If not set, the homepage property will be used, or the first author’s homepage (via the authors property).
ja: 設定されていない場合、homepage プロパティ、または、（authors プロパティ経由で）最初の作者の homepage が使用されます。

source: If not set, the support.docs property will be used.
ja: 設定されていない場合、support.docs プロパティが使用されます。

source: If not set, the support.email property will be used.
ja: 設定されていない場合、support.email プロパティが使用されます。

source: If not set, the current package version will be used.
ja: 設定されていない場合、現在のパッケージバージョンが使用されます。

source: If not set, the directory that contains your primary Plugin class will be used.
ja: 設定されてない場合、プライマリプラグインクラスを含むディレクトリが使用されます。

source: If not set, the first author’s name will be used (via the authors property).
ja: 設定されていない場合、（authors プロパティ経由で）最初の作者の name が使用されます。

source: If not set, the installer will look for a Plugin.php file at each of the autoload path roots.
ja: 設定されていない場合、インストーラーはそれぞれの autoload パスのルートで Plugin.php ファイルを探します。

source: If not set, the main description property will be used.
ja: 設定されていない場合、メインの description プロパティが使用されます。

source: If not set, the package name (sans vendor prefix) will be used.
ja: 設定されていない場合、（ベンダー接頭辞なしの）パッケージ名が使用されます。

source: If not, then the protocol in your Site URL will be used; if so, then https will be used.
ja: そうでなければ、サイト URL のプロトコルが使用され、SSL 経由なら https が使用されます。

source: If omitted, the element’s URL will be returned.
ja: 省略した場合、エレメントの URL が返されます。

source: If successful, you will get the Craft installation wizard.
ja: 成功していれば、Craft のインストールウィザードが表示されます。

source: If that Matrix field has more than one relational field and you want to target a specific one, you can specify the block type field’s handle using a dot notation:
ja: 複数の関連フィールドを持つ行列フィールドにある特定のフィールドだけをターゲットにしたい場合、ドット表記を利用してブロックタイプのフィールドハンドルを指定できます。

source: If that outputs an error saying composer is not found or not recognized, then Composer isn’t installed.
ja: composer が見つからない、あるいは、識別されないというエラーが出力されるなら、Composer がインストールされていません。

source: If that outputs something lower than 1.3.0, run composer self-update to update your Composer installation.
ja: 1.3.0 より前のバージョンであれば、Composer をアップデートするために composer self-update を実行します。

source: If that setting is checked, the field’s values are stored on a per-site basis.
ja: この設定がチェックされている場合、フィールドの値はサイトごとに格納されます。

source: If the URI matches an entry’s or category’s URI, Craft loads the section’s template or category group’s template.
ja: URL がエントリやカテゴリの URI にマッチする場合、Craft はセクションのテンプレートかカテゴリグループのテンプレートをロードします。

source: If the URI matches any dynamic routes, the template specified by that route will get loaded.
ja: URI がいずれかの動的なルートにマッチする場合、そのルートで指定されたテンプレートが読み込まれます。

source: If the migration is being run from a console request, this will ensure the message is seen by whoever is executing the migration, as the message will be output into the terminal.
ja: マイグレーションがコンソールリクエストから実行された場合、メッセージがターミナル内に出力されるため、マイグレーションを実行している人がそのメッセージを見ることを保証します。

source: If the option is unchecked, Craft will only save the new entry to the site you have currently selected.
ja: このオプションがチェックされていない場合、Craft は現在選択されているサイトのみに新しエントリを保存します。

source: If the route contains any tokens, they will be available as variables to that template.
ja: ルートにトークンが含まれる場合、そのテンプレートの変数として利用可能です。

source: If the table you are inserting into does not have all three of these columns, you must pass false to that argument so you don’t get a SQL error.
ja: 挿入しようとするテーブルがこれら3つのカラムすべてを持っていない場合、SQL エラーにならないよう、引数に false を渡す必要があります。

source: If the template doesn’t exist.
ja: テンプレートが存在しない場合、

source: If the “Restrict allowed file types?” setting is checked, a list of file types will appear below it.
ja: 「許可されるファイルの種類を制限しますか？」がオンの場合、その下にファイルの種類の一覧が表示されます。

source: If the “Restrict uploads to a single folder?” setting is checked, the “Sources” and “Default Upload Location” settings will be replaced with an “Upload Location” setting.
ja: 「アップロードを単一のフォルダに制限しますか？」がオンの場合、「ソース」と「既定のアップロードロケーション」は「ロケーションをアップロードする」に置き換えられます。

source: If the “Restrict uploads to a single folder?” setting is checked, the “Volumes” and “Default Upload Location” settings will be replaced with an “Upload Location” setting.
ja: 「アップロードを単一のフォルダに制限しますか？」がオンの場合、「ソース」と「既定のアップロードロケーション」は「ロケーションをアップロードする」に置き換えられます。

source: If there are 50 entries, this innocent-looking template code will cost the page 51 queries.
ja: 50エントリがある場合、この問題なさそうに見えるテンプレートコードは、そのページのために51クエリ分のコストがかかります。

source: If there are, it will hold off on caching the template until the next request, so those temporary image URLs won’t get cached.
ja: それが含まれる場合、次のリクエストまでテンプレートのキャッシュを保留するため、一時的な画像 URL はキャッシュされません。

source: If they are the same user, use 744.
ja: 同じユーザーであれば、744 を利用します。

source: If they aren’t, they will be redirected to the Login page, and returned to the original page after successfully logging in.
ja: そうでない場合、ログインページにリダイレクトし、ログインに成功した後で元のページに戻ります。

source: If they don’t have it, a 403 (Forbidden) error will be served.
ja: もし権限を持っていないなら、403（Forbidden）エラーが提供されます。

source: If they’re in the same group, then use 774.
ja: 同じグループであれば、774 を利用します。

source: If this happens, it’s because your database connection settings in the .env file don’t quite match up to what they used to be.
ja: これが起こるのは、.env ファイルのデータベース接続情報が実際に必要な情報と完全に一致しないためです。

source: If this is not provided, a random key will be generated when Twig first parses the template.
ja: これを指定しない場合、Twig が最初にテンプレートを解析するときにランダムなキーが生成されます。

source: If this site should be the Primary Site, toggle the 'Is Primary Site?' to enable it.
ja: このサイトをプライマリサイトにする場合、「これはプライマリサイトですか？」をオンに切り替えます。

source: If this site should be the Primary Site, toggle the Is Primary Site?
ja: このサイトをプライマリサイトにする場合は、「これはプライマリサイトですか？」をオンにします。

source: If we have a recipe entry that is available at the entry URL http://mysite.com/recipes/gin-tonic, which uses the template located at recipes/entry, someone could access the template directly at http://mysite.com/recipes/entry.
ja: recipes/entry にあるテンプレートを利用した、http://mysite.com/recipes/gin-tonic でアクセスできるレシピのエントリがある場合、誰でも http://mysite.com/recipes/entry で直接テンプレートにアクセスできてしまいます。

source: If we have an entry for a drink recipe where we select the ingredients as relationships (via an Entries Field), we'd label the elements as follows:
ja: （エントリフィールド経由で）関連する要素を選択したドリンクレシピ向けのエントリがある場合、エレメントに次のようにラベル付けします。

source: If we want to output the ingredients list for a drink recipe, we'd use the following:
ja: ドリンクレシピの原材料リストを出力したい場合、次のようにします。

source: If you access http://example.com/news/2020/10, your news/_archive.html template will get loaded with a matches variable set to this:
ja: http://example.com/news/2020/10 にアクセスすると、news/_archive.html テンプレートは、変数 matches をセットした状態で読み込まれます。

source: If you are including a Checkboxes field on a front-end entry from, make sure to include a hidden input before the checkboxes, so that an empty value is submitted if no checkboxes are checked.
ja: フロントエンドのエントリフォームにチェックボックスフィールドを含める場合、チェックボックスの前に不可視フィールドを含め、チェックボックスがチェックされなかった場合でも、空の値が送信されるようにしてください。

source: If you are starting a Craft 3 project from scratch, review the Craft 3 Installation instructions.
ja: ゼロから Craft 3 プロジェクトを始めるのであれば、Craft 3 インストールガイドを再確認してください。

source: If you are using db for your config setting, you'll need to manually execute some SQL before attempting the Craft 3 update.
ja: コンフィグ設定の に db を指定している場合、Craft 3 のアップデートを試す前に手動で SQL を実行する必要があります。

source: If you are using db for your cacheMethod config setting, you'll need to manually execute some SQL before attempting the Craft 3 update.
ja: コンフィグ設定の cacheMethod に db を指定している場合、Craft 3 のアップデートを試す前に手動で SQL を実行する必要があります。

source: If you are using memcache for your config setting and you did not have useMemcached set to true in your config/memcache.php config file, you'll need to install memcached on your server.
ja: コンフィグ設定の に memcache を指定し、設定ファイル config/memcache.php で useMemcached に true をセットしていない場合、サーバーに memcached をインストールする必要があります。

source: If you are using memcache for your config setting and you did not have useMemcached set to true in your craft/config/memcache.php config file, you'll need to install memcached on your server.
ja: コンフィグ設定の に memcache を指定し、設定ファイル craft/config/memcache.php で useMemcached に true をセットしていない場合、サーバーに memcached をインストールする必要があります。

source: If you are using memcache for your cacheMethod config setting and you did not have useMemcached set to true in your craft/config/memcache.php config file, you'll need to install memcached on your server.
ja: コンフィグ設定の cacheMethod に memcache を指定し、設定ファイル craft/config/memcache.php で useMemcached に true をセットしていない場合、サーバーに memcached をインストールする必要があります。

source: If you are using normal Twig tags, you can still access the source element, via an “object” variable.
ja: 通常の Twig タグでは、 変数「object」を使用してソースエレメントにアクセスできます。

source: If you believe someone is violating the code of conduct, we ask that you report it by emailing support@craftcms.com.
ja: もし誰かが行動規範に違反したと確信したなら、 support@craftcms.com 宛のメールで報告するようお願いします。

source: If you didn’t already have it enabled (via the enableCsrfProtection config setting), each of your front-end s and JS scripts that submit to a controller action will need to be updated with a new CSRF token param, named after your csrfTokenName config setting value (set to 'CRAFT_CSRF_TOKEN' by default).
ja: （コンフィグ設定の enableCsrfProtection で）有効化していなかった場合、 コントローラーアクションで送信するフロントエンドのすべての と JavaScript に新しい CSRF トークンパラメータを追加するアップデートが必要です。 あわせて、コンフィグ設定の csrfTokenName をセットする必要があります（デフォルトは 'CRAFT_CSRF_TOKEN' となります）。

source: If you do install the Redactor plugin, you will need to ensure that your Redactor configs in config/redactor/ are valid JSON.
ja: Redactor プラグインをインストールする場合、config/redactor/ に定義された Redactor 設定が有効な JSON であることを確認する必要があります。

source: If you do, Craft will look for the appropriate error template to render.
ja: その場合、Craft はレンダリングするための適切なエラーテンプレートを探します。

source: If you go that route, you can skip to step 3.
ja: そのルートを選ぶ場合、ステップ3までスキップできます。

source: If you go the latter route, note that the query property is required.
ja: 後者のルートを選択する場合、query プロパティは必須となる点に注意してください。

source: If you had any Position Select fields, they will be converted to Dropdown fields, with all the same options.
ja: 位置選択フィールドがある場合、すべてのオプションを保持したままドロップダウンフィールドに変換されます。

source: If you had any plugins installed, you’ll need to install their Craft 3 counterparts from the “Plugin Store” section in the Control Panel.
ja: プラグインをインストールしている場合、コントロールパネルの「プラグインストア」セクションから Craft 3 対応版をインストールする必要があります。

source: If you had made any changes to your public/index.php file, copy them to your new project’s web/index.php file.
ja: public/index.php ファイルに何らかの変更を加えていた場合、それらを新しいプロジェクトの web/index.php ファイルにコピーします。

source: If you have Craft Pro and want people to be able to register user accounts on your site, first go to Settings → Users → Settings and make sure that the “Allow Public Registration?” setting is checked.
ja: Craft Pro を使用し、サイトで誰でもユーザーアカウントを登録できるようにしたい場合は、初めに「設定 > ユーザー > 設定」に移動し、「一般登録を許可しますか？」設定にチェックが入っていることを確認します。

source: If you have Craft Pro, you can create User Groups to help organize your site’s user accounts, as well as batch-set permissions on them.
ja: Craft Pro を使っている場合、サイトのユーザーアカウントを整理したり、権限を一括設定するためにユーザーグループを作成することができます。

source: If you have a Body field, each site can store its only content in that field.
ja: 本文フィールドがある場合、それぞれのサイトはそのフィールドのコンテンツだけを保存できます。

source: If you have a Global Set with the handle companyInfo and it has a field with the handle yearEstablished, you can access that field anywhere using this code:
ja: companyInfo というハンドルのグローバル設定があり、yearEstablished というハンドルのフィールドがある場合、次のコードを使用してそのフィールドへどこからでもアクセスすることができます。

source: If you have a need to do something that is not possible out-of-the-box with Craft or Twig, you can create a plugin that provides a new Twig extension.
ja: Craft や Twig でそのまますぐに使うことのできない何かが必要になった場合、新しいTwig 拡張を提供するプラグインを作成することができます。

source: If you have a template route that contains subpatterns, Craft passes a matches array to the matched template containing them.
ja: テンプレートのルートがサブパターンを含む場合、Craft はマッチしたテンプレートに matches 配列を渡します。

source: If you have an element with a Categories field in your template, you can access its selected categories using your Category field’s handle:
ja: テンプレート内でカテゴリフィールドのエレメントを取得する場合、カテゴリフィールドのハンドルを利用して、選択されたカテゴリにアクセスできます。

source: If you have an element with a Tags field in your template, you can access its selected tags using your Tags field’s handle:
ja: テンプレート内でタグフィールドのエレメントを取得する場合、タグフィールドのハンドルを利用して、選択されたタグにアクセスできます。

source: If you have an element with a Users field in your template, you can access its selected users using your Users field’s handle:
ja: テンプレート内でユーザーフィールドのエレメントを取得する場合、ユーザーフィールドのハンドルを利用して、選択されたユーザーにアクセスできます。

source: If you have an element with an Assets field in your template, you can access its selected assets using your Assets field’s handle:
ja: テンプレート内でアセットフィールドのエレメントを取得する場合、アセットフィールドのハンドルを利用して、選択されたアセットにアクセスできます。

source: If you have an element with an Entries field in your template, you can access its selected entries using your Entries field’s handle:
ja: テンプレート内でエントリフィールドのエレメントを取得する場合、エントリフィールドのハンドルを利用して、選択されたエントリにアクセスできます。

source: If you have any URL rules saved in config/routes.php, you will need to update them to Yii 2’s pattern-route syntax.
ja: config/routes.php に URL を保存しているならば、Yii 2 の pattern-route 構文 にアップデートする必要があります。

source: If you have any asset volumes that were using those services in Craft 2, you will need to install the new plugins:
ja: それらのサービスを Craft 2 で利用していたアセットボリュームがある場合、新しいプラグインをインストールする必要があります。

source: If you have any element queries within the tags (e.g. a craft.entries), and you create a new element that should be returned by one of the queries, Craft will also be able to figure that out and clear the cache.
ja: タグ内にエレメント クエリ（例：craft.entries）を持ち、クエリの1つによって返される新しいエレメントを作成する場合、Craft はそれを判断してキャッシュをクリアすることもできます。

source: If you have any existing Rich Text fields, they will be automatically converted to Redactor fields when you install the Redactor plugin.
ja: いくつかのリッチテキストフィールドがすでに存在する場合、Redactor プラグインをインストールした時点で自動的に Redactor フィールドに変換されます。

source: If you have any local asset volumes, you will need to make sure those assets are available from each of your sites.
ja: ローカルのアセットボリュームがある場合、それらのアセットがそれぞれのサイトから利用可能であることを確認する必要があります。

source: If you have any templates that count on the Craft 2 behavior, you can fix them using the clone() function.
ja: Craft 2 動作に影響を与えるテンプレートがある場合、clone() ファンクションを用いて修正できます。

source: If you have any templates that you only want to serve from a specific site, you can create a new sub-folder in your templates folder, named after your site's handle, and place the templates in there.
ja: 特定のサイトからだけ配信したいテンプレートがある場合、テンプレートフォルダに新しいサブフォルダを作成し、サイトのハンドルをフォルダ名にして、その中に手テンプレートを配置します。

source: If you have at least one Global Set, Craft will add a new “Globals” item added to the Control Panel primary navigation.
ja: 少なくとも1つのグローバル設定があれば、Craft はコントロールパネルのメインナビゲーションに「グローバル」項目を追加します。

source: If you have at least one category group, there will be a “Categories” tab in the primary Control Panel navigation.
ja: 少なくとも1つのカテゴリグループがあれば、コントロールパネルのメインナビゲーションに「カテゴリ」タブが表示されます。

source: If you have at least one section, there will be an “Entries” tab in the primary CP nav.
ja: 少なくとも1つのセクションがあれば、CP のメインナビゲーションに「エントリ」タブが表示されます。

source: If you have changed that config setting, you will want to adjust the examples accordingly.
ja: コンフィグ設定を変更している場合、それに応じて前述のサンプルを調整してください。

source: If you have multiple sets of elements you wish to eager-load off of the top list of elements, just add additional values to your with parameter.
ja: エレメントの最上位のリストで eager-load しておきたいエレメントの複数セットがある場合は、with パラメータに値を追加してください。

source: If you have templates located at both craft/templates/recipes/ingredients.html
ja: もし、craft/templates/recipes/ingredients.html

source: If you haven’t set it yet, set it to the value in `storage/runtime/validation.key` (if the file exists).
ja: まだ設定していない場合、（ファイルが存在していれば）`storage/runtime/validation.key` に設定します。

source: If you just want simple Previous Page and Next Page links to appear, you can do this:
ja: 単純に前のページと次のページのリンクを表示させたいなら、次のようにできます。

source: If you just want to output blocks of a certain type, you can do that by appending a ‘type’ filter to your Matrix field:
ja: 特定のタイプのブロックだけを出力したい場合、行列フィールドに「type」フィルタを追加します。

source: If you leave Image Format blank, Craft will use the original image’s format if it’s web-safe (.jpg, .png, or .gif); otherwise it will try to figure out the best-suited image format for the job.
ja: 画像フォーマット を空欄のままにすると、Craft は web-safe（.jpg、 .png、または .gif） なら元画像のフォーマットを使い、そうでなければ、そのジョブに最適な画像フォーマットを見つけようと試みます。

source: If you leave Quality blank, Craft will use the quality set by your config setting.
ja: 品質 を空白のままにすると、Craft はコンフィグ設定の にセットされた品質を使用します。

source: If you leave Quality blank, Craft will use the quality set by your defaultImageQuality config setting.
ja: Quality を空白のままにすると、Craft はコンフィグ設定の defaultImageQuality にセットされた品質を使用します。

source: If you leave either Width or Height blank, that dimension will be set to whatever maintains the image’s aspect ratio.
ja: 幅 または 高さ のいずれかを空白のままにすると、その寸法は画像の縦横比を維持するようセットされます。

source: If you leave the Post Date blank, Craft will automatically set it the first time an entry is saved as enabled.
ja: 投稿日を空のままにした場合、Craft はエントリが有効な状態で保存された最初のタイミングで自動的にセットします。

source: If you miss Position Select, you can try installing the Position Fieldtype plugin, which brings it back.
ja: 位置選択フィールドが必要な場合、Position Fieldtype プラグインをインストールしてください。

source: If you name your template index.html, you don’t need to specify it in the template path.
ja: テンプレートの名前が index.html の場合、テンプレートパスで明示的に記述する必要はありません。

source: If you need more you can upgrade to the Pro edition, which offers additional user accounts.
ja: さらに必要であれば、追加のユーザーアカウントを提供する Pro エディションにアップグレードできます。

source: If you need more, you will need to upgrade to either Craft Client or Craft Pro, which offer additional user accounts.
ja: さらに必要であれば、追加のユーザーアカウントを提供する Craft Client か Craft Pro のどちらかにアップグレード する必要があります。

source: If you need to login a user from the front-end of your site, you can do so with the following code:
ja: サイトのフロントエンドからユーザーのログインが必要な場合、次のコードで実現できます。

source: If you need to set up routes to controller actions, or you need to create a template route that matches a URI pattern that’s not covered by the available route tokens in Settings → Routes, you can set up your routes in config/routes.php as well.
ja: コントローラーアクションへのルートをセットアップする必要がある場合や、「設定 > ルート」で利用可能なトークンがカバーされていない URI パターンにマッチさせるテンプレートルートを作成する必要がある場合、config/routes.php にルートを設定することもできます。

source: If you need to set up routes to controller actions, or you need to create a template route that matches a URI pattern that’s not covered by the available route tokens in Settings → Routes, you can set up your routes in craft/config/routes.php as well.
ja: コントローラーアクションへのルートをセットアップする必要がある場合や、「設定 > ルート」で利用可能なトークンがカバーされていない URI パターンにマッチさせるテンプレートルートを作成する必要がある場合、craft/config/routes.php にルートを設定することもできます。

source: If you only have one checkbox, and you just want to tell if it has been selected, you can do that using the length filter:
ja: チェックボックスを1つしかもたつ、それが選択されているかを知りたい場合、length フィルタを利用して確認できます。

source: If you only have one site then you cannot disable it as the Primary site.
ja: 1つしかサイトがない場合、プライマリサイトを無効にできません。

source: If you pass true into the last argument, the “.00” will be stripped if there’s zero cents.
ja: 最後の引数に true を渡すと、セントがゼロであれば「.00」が削除されます。

source: If you pass true into the second argument, the “.00” will be stripped if there’s zero cents.
ja: 第2引数に true を渡すと、セントがゼロであれば「.00」が削除されます。

source: If you run multiple sites with Craft, Global Sets are available in all sites.
ja: Craft でマルチサイトを運用している場合、グローバル設定はすべてのサイトで利用可能です。

source: If you see the update prompt, you did everything right!
ja: アップデートのプロンプトが表示されたら、すべてが正しく実行されています！

source: If you specify any named subpatterns, then those matches will also get their own variables.
ja: 名前付けされたサブパターンを指定する場合、マッチしたものも同様に独自の変数を取得します。

source: If you stick with Craft Personal, this is the only account you will be able to create.
ja: Craft Personal を使い続けるなら、あなたが作成可能な唯一のアカウントとなります。

source: If you stick with the Solo edition, this is the only account you will be able to create.
ja: Solo エディションを使い続けるなら、あなたが作成可能な唯一のアカウントとなります。

source: If you suspect that your search indexes don’t have the latest and greatest data, you can have Craft rebuild them with the Rebuild Search Indexes tool in Settings.
ja: 検索インデックスが最新かつ最高データでないと疑われる場合、設定にある検索インデックスの再構築ツールで Craft に再構築させることができます。

source: If you think you might have more that 100 blocks, and you want all of them to be returned, you can also set that parameter to null:
ja: 100以上のブロックがあり、それらすべてのブロックを返したいと考えるなら、パラメータを null にセットすることもできます。

source: If you want the front-end of your site to support password resetting, you need to create a template at the path specified by the ”setPasswordPath” config setting.
ja: サイトのフロントエンドでパスワードのリセットをサポートしたい場合、コンフィグ設定の「setPasswordPath」で指定されたパスにテンプレートを作成する必要があります。

source: If you want to allow users to upload files to an Assets field from a front-end entry form, you just need to do two things.
ja: フロントエンドのエントリフォームから、アセットフィールドへのファイルアップロードをユーザーに許可するには、2つの調整が必要です。

source: If you want to be a little more specific, relatedTo also accepts an object that contains the following properties:
ja: もう少し具体的であることを望むなら、relatedTo は次のプロパティを含むオブジェクトも受け入れます。

source: If you want to create a form that is able to edit a user’s own profile, you can do so with the following code:
ja: ユーザー自身のプロフィールを編集できるフォームを作成するには、次のコードで実現できます。

source: If you want to create a list of nearby pages, perhaps surrounding the current page number, you can do that too!
ja: おそらく現在のページ番号周辺の、近くのページのリストを作りたい場合、同様にできます。

source: If you want to create a site that will live at a completely different domain name, just make sure that its DNS record is pointing to your server, and make sure the web server is configured to point traffic for that domain to your web/ directory.
ja: 異なるドメイン名で稼働するサイトを作成したい場合、DNS レコードがそのサーバーを指していることを確認してください。さらに、ウェブサーバーがそのドメインへのトラフィックを web/ ディレクトリに向けるように設定されていることを確認してください。

source: If you want to create a site that will live at a different domain name, just make sure that its DNS record is pointing to your server, and make sure the web server is configured to point traffic for that domain to your web/ directory.
ja: 異なるドメイン名で稼働するサイトを作成したい場合、DNS レコードがそのサーバーを指していることを確認してください。さらに、ウェブサーバーがそのドメインへのトラフィックを web/ ディレクトリに向けるように設定されていることを確認してください。
